samples/jbossas/ordermgmt/src/main/resources/wsdl/OrderService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<definitions 
    targetNamespace="urn:switchyard-quickstart-demo:orders:1.0" 
    xmlns="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:tns="urn:switchyard-quickstart-demo:orders:1.0"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    
  <types>
    <xsd:schema 
        targetNamespace="urn:switchyard-quickstart-demo:orders:1.0" 
        xmlns:tns="urn:switchyard-quickstart-demo:orders:1.0" 
        xmlns:xs="http://www.w3.org/2001/XMLSchema">
        <xs:element name="submitOrder" type="tns:submitOrderType"/>
        <xs:element name="submitOrderResponse" type="tns:submitOrderResponseType"/>
        <xs:element name="order" type="tns:orderType"/>
        <xs:element name="orderAck" type="tns:orderAckType"/>
        <xs:complexType name="submitOrderType">
            <xs:sequence>
                <xs:element name="order" type="tns:orderType"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="submitOrderResponseType">
            <xs:sequence>
                <xs:element name="orderAck" type="tns:orderAckType"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="orderType">
            <xs:sequence>
                <xs:element name="orderId" type="xs:string"/>
                <xs:element name="itemId" type="xs:string"/>
                <xs:element name="quantity" type="xs:int"/>
                <xs:element name="customer" type="xs:string"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="orderAckType">
            <xs:sequence>
                <xs:element name="orderId" type="xs:string"/>
                <xs:element name="accepted" type="xs:boolean"/>
                <xs:element name="status" type="xs:string"/>
                <xs:element name="customer" type="xs:string"/>
                <xs:element name="total" type="xs:double"/>
            </xs:sequence>
        </xs:complexType>

        <xs:element name="makePayment" type="tns:makePaymentType"/>
        <xs:element name="makePaymentResponse" type="tns:makePaymentResponseType"/>
        <xs:element name="payment" type="tns:paymentType"/>
        <xs:element name="receipt" type="tns:receiptType"/>
        <xs:complexType name="makePaymentType">
            <xs:sequence>
                <xs:element name="payment" type="tns:paymentType"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="makePaymentResponseType">
            <xs:sequence>
                <xs:element name="receipt" type="tns:receiptType"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="paymentType">
            <xs:sequence>
                <xs:element name="customer" type="xs:string"/>
                <xs:element name="amount" type="xs:double"/>
            </xs:sequence>
        </xs:complexType>
        <xs:complexType name="receiptType">
            <xs:sequence>
                <xs:element name="customer" type="xs:string"/>
                <xs:element name="amount" type="xs:double"/>
            </xs:sequence>
        </xs:complexType>
    </xsd:schema>
  </types>
  
  <message name="submitOrder">
    <part name="parameters" element="tns:submitOrder"/>
  </message>
  <message name="submitOrderResponse">
    <part name="parameters" element="tns:submitOrderResponse"/>
  </message>
  <message name="makePayment">
    <part name="parameters" element="tns:makePayment"/>
  </message>
  <message name="makePaymentResponse">
    <part name="parameters" element="tns:makePaymentResponse"/>
  </message>
  
  <portType name="OrderService">
    <operation name="submitOrder">
      <input message="tns:submitOrder"/>
      <output message="tns:submitOrderResponse"/>
    </operation>
    <operation name="makePayment">
      <input message="tns:makePayment"/>
      <output message="tns:makePaymentResponse"/>
    </operation>
  </portType>
  
  <binding name="OrderServiceBinding" type="tns:OrderService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="submitOrder">
      <soap:operation soapAction="urn:switchyard-quickstart-demo:orders:1.0"/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="makePayment">
      <soap:operation soapAction="urn:switchyard-quickstart-demo:orders:1.0"/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  
  <service name="OrderService">
    <port name="OrderServicePort" binding="tns:OrderServiceBinding">
      <soap:address location="http://localhost:18001/test"/>
    </port>
  </service>
</definitions>

