samples/jbossas/ordermgmt/app/src/test/resources/xml/order5bad.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <orders:submitOrder xmlns:orders="urn:switchyard-quickstart-demo:orders:1.0">
            <order>
                <orderId>5</orderId>
                <itemId>BUTTER</itemId>
                <quantity>100</quantity>
            	<customerx>Alice</customerx>
            </order>
        </orders:submitOrder>
    </soap:Body>
</soap:Envelope>
